<?xml version="1.0" encoding="UTF-8"?><rss xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:content="http://purl.org/rss/1.0/modules/content/" xmlns:atom="http://www.w3.org/2005/Atom" version="2.0" xmlns:media="http://search.yahoo.com/mrss/"><channel><title><![CDATA[null]]></title><description><![CDATA[null]]></description><link>http://localhost:2368/</link><image><url>http://localhost:2368/favicon.png</url><title>null</title><link>http://localhost:2368/</link></image><generator>Ghost 5.65</generator><lastBuildDate>Fri, 27 Oct 2023 12:52:12 GMT</lastBuildDate><atom:link href="http://localhost:2368/rss/" rel="self" type="application/rss+xml"/><ttl>60</ttl><item><title><![CDATA[Oauth로그인 리팩토링]]></title><description><![CDATA[<p>&#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC9C4;&#xD589; &#xD558;&#xBA70; &#xD68C;&#xC6D0; &#xAC00;&#xC785; &#xC11C;&#xBE44;&#xC2A4;&#xC758; &#xC77C;&#xBD80;&#xBD84;&#xC778; Oauth &#xB85C;&#xADF8;&#xC778; &#xBD80;&#xBD84;&#xC744; &#xCD1D; 3 &#xB2E8;&#xACC4;&#xC5D0; &#xAC78;&#xCCD0; &#xB9AC;&#xD329; &#xD1A0;&#xB9C1;&#xC744; &#xC9C4;&#xD589;&#xD558;&#xC600;&#xACE0; &#xADF8; &#xACFC;&#xC815;&#xC5D0;&#xC11C;</p>]]></description><link>http://localhost:2368/test/</link><guid isPermaLink="false">650fddfcf73c6c4074cc43f8</guid><category><![CDATA[Posts]]></category><dc:creator><![CDATA[gamja]]></dc:creator><pubDate>Sun, 24 Sep 2023 06:59:20 GMT</pubDate><content:encoded><![CDATA[<p>&#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC9C4;&#xD589; &#xD558;&#xBA70; &#xD68C;&#xC6D0; &#xAC00;&#xC785; &#xC11C;&#xBE44;&#xC2A4;&#xC758; &#xC77C;&#xBD80;&#xBD84;&#xC778; Oauth &#xB85C;&#xADF8;&#xC778; &#xBD80;&#xBD84;&#xC744; &#xCD1D; 3 &#xB2E8;&#xACC4;&#xC5D0; &#xAC78;&#xCCD0; &#xB9AC;&#xD329; &#xD1A0;&#xB9C1;&#xC744; &#xC9C4;&#xD589;&#xD558;&#xC600;&#xACE0; &#xADF8; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xACAA;&#xC740; &#xACE0;&#xBBFC;&#xC774;&#xB098; &#xD574;&#xACB0; &#xACFC;&#xC815;&#xC744; &#xC815;&#xB9AC;&#xD574;&#xBCF4;&#xACE0;&#xC790; &#xD569;&#xB2C8;&#xB2E4;.</p><h2 id="%EB%AC%B8%EC%A0%9C-%EC%A0%95%EC%9D%98">&#xBB38;&#xC81C; &#xC815;&#xC758;</h2><p>&#xB85C;&#xADF8;&#xC778; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xC9C4;&#xD589;&#xD558;&#xBA70; &#xD68C;&#xC6D0; &#xAC00;&#xC785;&#xC744; Oauth&#xB97C; &#xD1B5;&#xD574; &#xD558;&#xAE30;&#xB85C; &#xACB0;&#xC815;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCD5C;&#xCD08; Github&#xB97C; &#xD1B5;&#xD574; &#xD558;&#xAE30;&#xB85C; &#xACB0;&#xC815;&#xD588;&#xACE0;, &#xA0;Github&#xB97C; &#xD1B5;&#xD574; &#xD68C;&#xC6D0; &#xC815;&#xBCF4;&#xB97C; &#xBC1B;&#xC544; Jwt&#xB97C; &#xD1B5;&#xD574; &#xB85C;&#xADF8;&#xC778; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xAD6C;&#xCD95;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h3 id="%EB%AC%B8%EC%A0%9C-%EB%B0%9C%EC%83%9D">&#xBB38;&#xC81C; &#xBC1C;&#xC0DD;</h3><p>&#xD300;&#xC6D0;&#xB4E4; &#xACFC;&#xC758; &#xC758;&#xB17C; &#xD6C4; &#xCD94;&#xAC00;&#xC801;&#xC778; &#xD68C;&#xC6D0; &#xAC00;&#xC785; &#xD50C;&#xB7AB;&#xD3FC; &#xD655;&#xC7A5;&#xC744; &#xC704;&#xD574; Kakao Oauth &#xB610;&#xD55C; &#xB3C4;&#xC785; &#xD558;&#xAE30;&#xB85C; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C; &#xBB38;&#xC81C;&#xAC00; &#xBC1C;&#xC0DD;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xA0;&#xD655;&#xC7A5;&#xC131;&#xC744; &#xACE0;&#xB824;&#xD558;&#xC9C0; &#xC54A;&#xC740; &#xC124;&#xACC4;&#xC5D0; &#xC758;&#xD574; &#xB2E4;&#xB978; &#xD50C;&#xB7AB;&#xD3FC; &#xD68C;&#xC6D0; &#xAC00;&#xC785;&#xC2DC; API&#xB97C; &#xD558;&#xB098; &#xB354; &#xCD94;&#xAC00; &#xD574;&#xC57C;&#xD588;&#xACE0; &#xA0;&#xAE30;&#xC874;&#xC758; &#xCF54;&#xB4DC;&#xC5D0; &#xC911;&#xBCF5;&#xC774; &#xB9CE;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h2 id="%EC%9B%90%EC%9D%B8">&#xC6D0;&#xC778;</h2><p></p><!--kg-card-begin: markdown--><pre><code class="language-java">   @Transactional
    public MemberLoginResponse login(String code) {
        AccessTokenResponseDTO token = oauth.getToken(code);
        logger.debug(&quot;token access &#xD1A0;&#xD070; = {}&quot;, token);
        OAuthMemberInfoDTO memberInfo = oauth.getUserInfo(token.getAccessToken());

        if (MemberExists(memberInfo)) {
            Member member = findMemberByMemberName(memberInfo.getLogin());
            Member updateMember = memberRepository.save(member.update(memberInfo, token.getAccessToken()));
            String jwtToken = jwtService.createToken(updateMember);
            return MemberLoginResponse.of(updateMember, jwtToken);
        }

        Member member = memberRepository.save(Member.create(memberInfo, token.getAccessToken()));
        String jwtToken = jwtService.createToken(member);
        
        return MemberLoginResponse.of(member, jwtToken);
    }
</code></pre>
<!--kg-card-end: markdown--><!--kg-card-begin: markdown--><pre><code class="language-java">  @Operation(
            summary = &quot;&#xAE43;&#xD5C8;&#xBE0C; &#xB85C;&#xADF8;&#xC778;&quot;,
            tags = &quot;member&quot;,
            description = &quot;&#xC0AC;&#xC6A9;&#xC790; &#xAE43;&#xD5C8;&#xBE0C;&#xB97C; &#xD1B5;&#xD55C; &#xB85C;&#xADF8;&#xC778;&quot;
    )
    @PostMapping(&quot;/auth/login&quot;)
    public BasicResponse&lt;MemberLoginResponse&gt; login(@RequestParam String code) throws IOException, InterruptedException {
        MemberLoginResponse memberResponseDTO = memberService.login(code);

        return BasicResponse.&lt;MemberLoginResponse&gt;builder()
                .success(true)
                .message(&quot;&quot;)
                .apiStatus(20000)
                .httpStatus(HttpStatus.OK)
                .data(memberResponseDTO)
                .build();
    }

</code></pre>
<!--kg-card-end: markdown--><p></p><p>&#xCEE8;&#xD2B8;&#xB864;&#xB7EC;&#xC640; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xC704;&#xC640; &#xAC19;&#xC774; &#xAD6C;&#xD604;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. Service &#xB808;&#xC774;&#xC5B4;&#xC5D0;&#xC11C; code&#xB97C; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xB85C; &#xBC1B;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774; &#xCF54;&#xB4DC;&#xB294; Oauth&#xB97C; &#xD574;&#xC8FC;&#xB294; &#xD50C;&#xB7AB;&#xD3FC;&#xC73C;&#xB85C; &#xBD80;&#xD130; &#xBC1B;&#xB294; &#xCF54;&#xB4DC;&#xC774;&#xACE0; &#xC774;&#xCF54;&#xB4DC;&#xB85C;&#xB294; &#xC0AC;&#xC2E4; &#xC5B4;&#xB5A4; &#xD50C;&#xB7AB;&#xD3FC;&#xC73C;&#xB85C; &#xBD80;&#xD130; &#xBC1B;&#xC740; &#xCF54;&#xB4DC;&#xC778;&#xC9C0;&#xB294; Spring&#xC5D0;&#xC11C; &#xD655;&#xC778; &#xD560; &#xC218; &#xAC00; &#xC5C6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC989; Kakao &#xD68C;&#xC6D0; &#xAC00;&#xC785; &#xC804;&#xC6A9; Api&#xB97C; &#xB9CC;&#xB4E0;&#xB2E4; &#xD558;&#xB354;&#xB77C;&#xB3C4; Service&#xC5D0;&#xC11C;&#xB294; Kakao&#xC5D0;&#xC11C; &#xC628; &#xAC83;&#xC778;&#xC9C0; Github&#xC5D0;&#xC11C; &#xC628; &#xAC83;&#xC778;&#xC9C0; &#xC54C; &#xC218; &#xAC00; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h2 id="%EC%B2%AB-%EB%B2%88%EC%A7%B8-%ED%95%B4%EA%B2%B0%EC%B1%85">&#xCCAB; &#xBC88;&#xC9F8; &#xD574;&#xACB0;&#xCC45;</h2><p></p><p>&#xCC98;&#xC74C; &#xB4E0; &#xC0DD;&#xAC01;&#xC740; &#xB2E8;&#xC21C;&#xD788; API&#xB97C; &#xD558;&#xB098; &#xB354; &#xB9CC;&#xB4E4;&#xC790; &#xC600;&#xC2B5;&#xB2C8;&#xB2E4;. Kakao &#xC804;&#xC6A9; Api&#xB97C; &#xB9CC;&#xB4E4;&#xACE0; &#xC774;&#xB97C; &#xAD6C;&#xBD84; &#xD560; &#xC218; &#xC788;&#xB294; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4; &#xD0C0;&#xC785;&#xC744; &#xB9CC;&#xB4E4;&#xC5B4; Service &#xB808;&#xC774;&#xC5D0;&#xC11C; &#xD0C0;&#xC785;&#xC744; &#xAD6C;&#xBD84;&#xD558;&#xC790; &#xB77C;&#xB294; &#xC0DD;&#xAC01;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h3 id="%EC%BB%A8%ED%8A%B8%EB%A1%A4%EB%9F%AC%EC%97%90-api%EB%A5%BC-%ED%95%98%EB%82%98-%EB%8D%94-%EC%B6%94%EA%B0%80">&#xCEE8;&#xD2B8;&#xB864;&#xB7EC;&#xC5D0; Api&#xB97C; &#xD558;&#xB098; &#xB354; &#xCD94;&#xAC00;</h3><!--kg-card-begin: markdown--><pre><code class="language-java">  @Operation(
            summary = &quot;&#xCE74;&#xCE74;&#xC624; &#xB85C;&#xADF8;&#xC778;&quot;,
            tags = &quot;members&quot;,
            description = &quot;&#xC0AC;&#xC6A9;&#xC790; &#xCE74;&#xCE74;&#xC624;&#xB97C; &#xD1B5;&#xD55C; &#xB85C;&#xADF8;&#xC778;&quot;
    )
    @PostMapping(&quot;/auth/kakao/login&quot;)
    public BasicResponse&lt;MemberLoginResponse&gt; kakaoLogin(@RequestBody KakaoRequestCode params) {
        log.debug(&quot;&#xD504;&#xB860;&#xD2B8;&#xB85C; &#xBD80;&#xD130; &#xBC1B;&#xC740; &#xCF54;&#xB4DC; = {}&quot;, params);
        MemberLoginResponse memberResponseDTO = memberService.login(params);

        return BasicResponse.send(&quot;&#xCE74;&#xCE74;&#xC624; &#xB85C;&#xADF8;&#xC778;&quot;, memberResponseDTO);
    }
</code></pre>
<!--kg-card-end: markdown--><p>&#xC704;&#xC640; &#xAC19;&#xC740; Api&#xB97C; &#xD558;&#xB098; &#xB354; &#xB9CC;&#xB4E4;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC2E4;&#xC0C1; github&#xC640; &#xD638;&#xCD9C;&#xD558;&#xB294; uri&#xC640; request dto&#xB9CC; &#xB2E4;&#xB97C; &#xBFD0; &#xAC19;&#xC740; login &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; return&#xD569;&#xB2C8;&#xB2E4;.</p><h3 id="%EA%B0%81-%ED%94%8C%EB%9E%AB%ED%8F%BC%EC%9D%80-%EC%9D%B8%ED%84%B0%ED%8E%98%EC%9D%B4%EC%8A%A4%EB%A5%BC-%EA%B5%AC%ED%98%84%ED%95%98%EB%8F%84%EB%A1%9D-%ED%95%9C%EB%8B%A4">&#xAC01; &#xD50C;&#xB7AB;&#xD3FC;&#xC740; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xB97C; &#xAD6C;&#xD604;&#xD558;&#xB3C4;&#xB85D; &#xD55C;&#xB2E4;. </h3><!--kg-card-begin: markdown--><pre><code class="language-java">package com.secondhand.oauth.dto.req;

import com.secondhand.oauth.OAuthProvider;
import lombok.Getter;
import lombok.NoArgsConstructor;
import org.springframework.util.LinkedMultiValueMap;
import org.springframework.util.MultiValueMap;

@Getter
@NoArgsConstructor
public class KakaoRequestCode implements OAuthLoginParams {
    private String authorizationCode;

    @Override
    public OAuthProvider oAuthProvider() {
        return OAuthProvider.KAKAO;
    }


    @Override
    public MultiValueMap&lt;String, String&gt; makeBody() {
        MultiValueMap&lt;String, String&gt; body = new LinkedMultiValueMap&lt;&gt;();
        body.add(&quot;code&quot;, authorizationCode);
        return body;
    }
}
</code></pre>
<pre><code>
package com.secondhand.oauth.dto.req;

import com.secondhand.oauth.OAuthProvider;
import org.springframework.util.MultiValueMap;

public interface OAuthLoginParams {
    OAuthProvider oAuthProvider();

    MultiValueMap&lt;String, String&gt; makeBody();
}
</code></pre>
<pre><code class="language-java">//&#xC774; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xB97C; &#xCE74;&#xCE74;&#xC624;&#xC640; &#xAE43;&#xD5C8;&#xBE0C;&#xAC00; &#xAC01;&#xAC01; &#xAD6C;&#xD604;&#xD558;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;.
   public interface Oauth {
    OAuthProvider oAuthProvider();

    AccessTokenResponseDTO getToken(OAuthLoginParams params);

    OAuthInfoResponse getUserInfo(String accessToken);
}
 
</code></pre>
<!--kg-card-end: markdown--><p>&#xC704;&#xC640; &#xAC19;&#xC774; <strong>OAuthLoginParams &#xA0;</strong>&#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xB97C; &#xD1B5;&#xD574; &#xA0;&#xAC01; &#xD50C;&#xB7AB;&#xD3FC;&#xC744; &#xBE44;&#xAD50;&#xD558;&#xACE0; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0;&#xC11C; &#xAC01; &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0; &#xB9DE;&#xAC8C; &#xB054; requestOAuthInfoService.request(params, userAgent); &#xC5D0; &#xB9DE;&#xB294; OAuthInfoResponse(&#xCE74;&#xCE74;&#xC624;&#xB098;, &#xAE43;&#xD5C8;&#xBE0C;&#xB85C; &#xBD80;&#xD130; &#xBC1B;&#xC740; &#xC720;&#xC800; &#xC815;&#xBCF4;)&#xB97C; &#xBC1B;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;.</p><p></p><!--kg-card-begin: markdown--><pre><code class="language-java">@Component
public class RequestOAuthInfoService {
    private final Map&lt;OAuthProvider, Oauth&gt; clients;

    public RequestOAuthInfoService(List&lt;Oauth&gt; clients) {
        this.clients = clients.stream().collect(
                Collectors.toUnmodifiableMap(Oauth::oAuthProvider, Function.identity())
        );
    }

    public OAuthInfoResponse request(OAuthLoginParams params) {
        Oauth client = clients.get(params.oAuthProvider());
        AccessTokenResponseDTO token = client.getToken(params);
        return client.getUserInfo(String.valueOf(token));
    }
}
</code></pre>
<!--kg-card-end: markdown--><p>&#xC704; &#xC11C;&#xBE44;&#xC2A4; &#xD074;&#xB808;&#xC2A4;&#xC5D0;&#xC11C; parms&#xB97C; &#xBE44;&#xAD50;&#xD558;&#xC5EC; &#xAC01; oauth&#xC5D0; &#xB9DE;&#xB294; Dto&#xB97C; &#xBC18;&#xD658;&#xD558;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;.</p><p></p><!--kg-card-begin: markdown--><pre><code class="language-java">  @Transactional
    public MemberLoginResponse login(OAuthLoginParams params, String userAgent) throws IOException {
        OAuthInfoResponse oAuthInfoResponse = requestOAuthInfoService.request(params, userAgent);

      ````&#xC0DD;&#xB7B5;
        return MemberLoginResponse.of(member, jwtToken);
    }
</code></pre>
<!--kg-card-end: markdown--><p>&#xC774;&#xB85C;&#xC11C; Reuqest&#xC5D0; &#xB530;&#xB77C; &#xAC01; &#xD50C;&#xB81B;&#xD3FC;&#xC744; &#xAD6C;&#xBD84; &#xD558;&#xC5EC; &#xADF8;&#xC5D0; &#xB9DE;&#xB294; dto&#xB97C; &#xBC18;&#xD658; &#xD560; &#xC218; &#xC788;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h3 id="%EB%91%90-%EB%B2%88%EC%A7%B8-%EB%AC%B8%EC%A0%9C">&#xB450; &#xBC88;&#xC9F8; &#xBB38;&#xC81C;</h3><p>&#xD558;&#xC9C0;&#xB9CC; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xD574;&#xB3C4; &#xBB38;&#xC81C;&#xAC00; &#xC644;&#xC804;&#xD788; &#xD574;&#xACB0;&#xB418;&#xC9C0;&#xB294; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC2E4; &#xD50C;&#xB81B;&#xD3FC;&#xC774; &#xCD94;&#xAC00;&#xB41C;&#xB2E4;&#xACE0; Api&#xAC00; &#xB298;&#xC5B4;&#xB098;&#xB294; &#xAC74; &#xC790;&#xC5F0;&#xC2A4;&#xB7FD;&#xC9C0; &#xBABB;&#xD55C; &#xD750;&#xB984;&#xC774;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xC694;&#xAD6C; &#xC0AC;&#xD56D;&#xC774; &#xBCC0;&#xACBD; &#xB420; &#xC2DC; &#xB9CC;&#xC57D; Naver&#xB098; Google&#xAC19;&#xC740; &#xB2E4;&#xB978; &#xC11C;&#xBE44;&#xC2A4;&#xAC00; &#xCD94;&#xAC00; &#xB41C;&#xB2E4;&#xACE0; &#xAC00;&#xC815;&#xD588;&#xC744; &#xB54C; &#xC9C0;&#xAE08;&#xC758; &#xAD6C;&#xC870;&#xC5D0;&#xC11C;&#xB294; &#xD50C;&#xB7AB;&#xD3FC;&#xC774; &#xCD94;&#xAC00; &#xB420; &#xB54C;&#xB9C8;&#xB2E4; Api&#xB97C; &#xCD94;&#xAC00; &#xD574;&#xC57C;&#xD558;&#xB294;&#xB370; &#xC774;&#xB294; &#xD14C;&#xC2A4;&#xD2B8; &#xAD00;&#xC810;&#xC5D0;&#xC11C; &#xBD24;&#xC744; &#xB54C;&#xB3C4; &#xBE44;&#xD6A8;&#xC728;&#xC801;&#xC774;&#xACE0; &#xAD73;&#xC774; &#xBC18;&#xBCF5;&#xB418;&#xB294; &#xC9C0;&#xB8E8;&#xD55C; &#xCF54;&#xB4DC;&#xB97C; &#xC368;&#xC57C; &#xD558;&#xB294; &#xBE44;&#xD6A8;&#xC728;&#xC131;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xA0; </p><p>&#xD0C0;&#xC785;&#xC774; &#xB2E4;&#xB974;&#xB2E4; &#xD558;&#xB354;&#xB77C;&#xB3C4; &#xA0;login&#xC11C;&#xBE44;&#xC2A4; &#xCF54;&#xB4DC;&#xB294; &#xC791;&#xC740; &#xBD80;&#xBD84; &#xBE7C;&#xACE0;&#xB294; &#xB2E4; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBA54;&#xC11C;&#xB4DC;&#xB294; &#xD558;&#xB098;&#xB85C; &#xC720;&#xC9C0; &#xD558;&#xACE0; , &#xB610;&#xD55C; &#xBD88;&#xD544;&#xC694;&#xD55C; &#xD074;&#xB798;&#xC2A4;&#xB098; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xB97C; &#xC8FD;&#xC5EC; &#xC5ED;&#xD560;&#xACFC; &#xD611;&#xB825;&#xC5D0; &#xB9DE;&#xAC8C; &#xA0;&#xB9AC;&#xD329;&#xD1A0;&#xB9C1;&#xC774; &#xD544;&#xC694;&#xD55C; &#xC2DC;&#xC810;&#xC774;&#xB77C; &#xD310;&#xB2E8;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xC815;&#xB9AC;&#xD574;&#xBCF4;&#xC790;&#xBA74;</p><ol><li>&#xCEE8;&#xD2B8;&#xB864;&#xB7EC;&#xC758; &#xBA54;&#xC11C;&#xB4DC;&#xB294; &#xD50C;&#xB81B;&#xD3FC;&#xC774; &#xB298;&#xC5B4;&#xB098;&#xB3C4; &#xD558;&#xB098;&#xB85C; &#xC720;&#xC9C0;&#xD558;&#xC790;.</li><li>&#xCF54;&#xB4DC;&#xC758; &#xAC00;&#xB3C5;&#xC131;&#xC774; &#xB5A8;&#xC5B4;&#xC9C0;&#xACE0; &#xD074;&#xB798;&#xC2A4;&#xB4E4;&#xC758; &#xC5ED;&#xD560;&#xC774; &#xBAA8;&#xD638;&#xD55C; &#xBD80;&#xBD84;&#xC774; &#xB9CE;&#xB2E4;. &#xB9AC;&#xD329;&#xD1A0;&#xB9C1;&#xC774; &#xD544;&#xC694;&#xD558;&#xB2E4;.</li></ol><h2 id="%EB%91%90-%EB%B2%88%EC%A7%B8-%ED%95%B4%EA%B2%B0%EC%B1%85">&#xB450; &#xBC88;&#xC9F8; &#xD574;&#xACB0;&#xCC45;</h2><p></p><h2 id="%EA%B5%AC%ED%98%84">&#xAD6C;&#xD604;</h2><p></p><h2 id="%EA%B2%B0%EA%B3%BC">&#xACB0;&#xACFC;</h2><h2></h2>]]></content:encoded></item></channel></rss>