<?xml version="1.0" encoding="UTF-8"?><rss xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:content="http://purl.org/rss/1.0/modules/content/" xmlns:atom="http://www.w3.org/2005/Atom" version="2.0" xmlns:media="http://search.yahoo.com/mrss/"><channel><title><![CDATA[null]]></title><description><![CDATA[null]]></description><link>http://localhost:2368/</link><image><url>http://localhost:2368/favicon.png</url><title>null</title><link>http://localhost:2368/</link></image><generator>Ghost 5.65</generator><lastBuildDate>Mon, 20 Nov 2023 12:50:21 GMT</lastBuildDate><atom:link href="http://localhost:2368/rss/" rel="self" type="application/rss+xml"/><ttl>60</ttl><item><title><![CDATA[채팅 도메인 고민과 의존성 문제(feat: Spring Event)]]></title><description><![CDATA[<p></p><h1 id="%EC%83%81%ED%99%A9-%EB%AC%B8%EC%A0%9C-%EC%A0%95%EC%9D%98">&#xC0C1;&#xD669;, <strong><strong>&#xBB38;&#xC81C; &#xC815;&#xC758;</strong></strong></h1><p>&#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xC9C4;&#xD589; &#xB3C4;&#xC911; &#xC2E4;&#xC2DC;&#xAC04; &#xCC44;&#xD305; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xAD6C;&#xCD95; &#xD558;&#xB294; &#xACFC;&#xC815;&#xC744; &#xC815;&#xB9AC;&#xD574; &#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCF54;&#xB4DC; &#xBCF4;&#xB2E4;&#xB294; &#xCC44;&#xD305;&#xC744; &#xC9C4;&#xD589;&#xD558;&#xB294; &#xACFC;</p>]]></description><link>http://localhost:2368/domein/</link><guid isPermaLink="false">6552313e3b0dff41f08f2351</guid><category><![CDATA[Posts]]></category><dc:creator><![CDATA[gamja]]></dc:creator><pubDate>Wed, 15 Nov 2023 12:47:31 GMT</pubDate><content:encoded><![CDATA[<p></p><h1 id="%EC%83%81%ED%99%A9-%EB%AC%B8%EC%A0%9C-%EC%A0%95%EC%9D%98">&#xC0C1;&#xD669;, <strong><strong>&#xBB38;&#xC81C; &#xC815;&#xC758;</strong></strong></h1><p>&#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xC9C4;&#xD589; &#xB3C4;&#xC911; &#xC2E4;&#xC2DC;&#xAC04; &#xCC44;&#xD305; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xAD6C;&#xCD95; &#xD558;&#xB294; &#xACFC;&#xC815;&#xC744; &#xC815;&#xB9AC;&#xD574; &#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCF54;&#xB4DC; &#xBCF4;&#xB2E4;&#xB294; &#xCC44;&#xD305;&#xC744; &#xC9C4;&#xD589;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xAE30;&#xC220;&#xC744; &#xC4F4; &#xC774;&#xC720;&#xC640; &#xACAA;&#xC5C8;&#xB358; &#xACE0;&#xBBFC;&#xC774;&#xB098; &#xC7A5;&#xC560;&#xB97C; &#xC815;&#xB9AC;&#xD574;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xCC44;&#xD305; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0; &#xC6F9; &#xC18C;&#xCF13; , STOMP PUB/SUB &#xAD6C;&#xC870;&#xB97C; &#xD1B5;&#xD55C; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xAD6C;&#xD604; &#xD558;&#xAE30; &#xAE4C;&#xC9C0; &#xA0;&#xACFC;&#xC815;&#xACFC; &#xA0;Redis&#xB3C4;&#xC785; &#xACFC;&#xC815;&#xACFC; &#xB3C4;&#xBA54;&#xC778; &#xC758;&#xC874;&#xC131; &#xBB38;&#xC81C;&#xB97C; &#xAC1C;&#xC120;&#xD558;&#xB294; &#xACFC;&#xC815;&#xACFC; &#xCD5C;&#xC885;&#xC801;&#xC73C;&#xB85C; &#xC774;&#xBCA4;&#xD2B8; &#xC801;&#xC6A9;, &#xD2B8;&#xB79C;&#xC7AD;&#xC158; &#xBD84;&#xB9AC;, &#xBE44;&#xB3D9;&#xAE30; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC744; &#xC815;&#xB9AC;&#xD574; &#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xBA3C;&#xC800; &#xCC44;&#xD305; &#xC11C;&#xBE44;&#xC2A4;&#xB294; &#xD06C;&#xAC8C; 3&#xAC00;&#xC9C0;&#xB85C; &#xB098;&#xB204;&#xC5B4;&#xC838; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ul><li>STOMP ,Redis&#xB97C; &#xC774;&#xC6A9;&#xD55C; Pub/Sub&#xAD6C;&#xB3C5;</li><li>&#xCC44;&#xD305; &#xB85C;&#xADF8;(&#xB2E4;&#xB978; &#xD68C;&#xC6D0;&#xC5D0;&#xAC8C; &#xBCF4;&#xB0BC; &#xCC44;&#xD305; &#xBA54;&#xC138;&#xC9C0; &#xC774; &#xBA54;&#xC138;&#xC9C0;&#xB294; DB&#xC5D0; &#xC800;&#xC7A5;&#xD55C;&#xB2E4;.) &#xBCF4;&#xB0B4;&#xAE30;</li><li>&#xCD94;&#xAC00;&#xC801;&#xC73C;&#xB85C; &#xCC44;&#xD305;&#xC744; &#xBCF4;&#xB0BC; &#xC2DC; &#xC54C;&#xB9BC; &#xACC4;&#xD68D;</li></ul><h1 id="%EC%B2%AB-%EB%B2%88%EC%A7%B8-%EC%8B%9C%EB%8F%84">&#xCCAB; &#xBC88;&#xC9F8; &#xC2DC;&#xB3C4;</h1><p>&#xCCAB; &#xBC88;&#xC9F8; &#xBA3C;&#xC800; &#xB4E0; &#xC0DD;&#xAC01;&#xC740; &#xCC44;&#xD305;&#xC744; &#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; <strong><strong>polling</strong></strong>, <strong><strong>websocket</strong></strong> &#xB450; &#xAC00;&#xC9C0; &#xC911; &#xC120;&#xD0DD;&#xD574;&#xC57C;&#xACA0;&#xB2E4;&#xB294; &#xC0DD;&#xAC01;&#xC774; &#xB4E4;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ul><li>WebSocket &#xBC29;&#xC2DD;&#xC740; Http&#xAC00;&#xC544;&#xB2CC; &#xA0;WS&#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xB2E8;&#xC21C;&#xD55C; API&#xB85C; &#xD1B5;&#xC2E0;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xACE0; &#xC591;&#xBC29;&#xD5A5;&#xC131;&#xACFC; &#xC2E4;&#xC2DC;&#xAC04;&#xC131;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li><li><strong><strong>polling</strong></strong> &#xBC29;&#xC2DD;(Long polling&#xD3EC;&#xD568;)&#xC740; &#xC790;&#xCCB4;&#xAC00; &#xC11C;&#xBC84;&#xC5D0; &#xC8FC;&#xAE30;&#xC801;&#xC73C;&#xB85C; HTTP &#xC694;&#xCCAD;&#xC744; &#xBCF4;&#xB0B4;&#xB294; &#xBC29;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;.</li></ul><p>&#xC694;&#xCCAD;&#xC744; &#xC9C0;&#xC18D;&#xC801; &#xC5F0;&#xACB0;&#xC744; &#xD1B5;&#xD574; &#xBCF4;&#xB0B4;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2CC; &#xC77C;&#xC815; &#xC2DC;&#xAC04;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xBCF4;&#xB0C5;&#xB2C8;&#xB2E4;.</p><p>&#xC774;&#xC810;&#xC774; &#xC2E4;&#xC2DC;&#xAC04; &#xCC44;&#xD305;&#xACFC;&#xB294; &#xB9DE;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xB294; &#xC0DD;&#xAC01;&#xC774; &#xB4E4;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xC624;&#xD788;&#xB824; &#xA0;&#xB370;&#xC774;&#xD130;&#xAC00; &#xC790;&#xC8FC; &#xBCC0;&#xACBD;&#xB418;&#xBA74; &#xC11C;&#xBC84;&#xC5D0; &#xBD80;&#xB2F4;&#xAC10;&#xC744; &#xC8FC;&#xC5B4; &#xBE44;&#xC6A9;&#xB3C4; &#xB9CC;&#xB9CC;&#xCE58; &#xC54A;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xC774;&#xBCA4;&#xD2B8;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xAC8C; &#xB418;&#xBA74; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xC694;&#xCCAD;&#xC744; &#xB3D9;&#xC2DC;&#xC5D0; &#xBCF4;&#xB0B4;&#xAC8C; &#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC11C;&#xBC84;&#xC758; &#xBD80;&#xB2F4;&#xC774; &#xAE09;&#xC99D;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; ScaleOut&#xC73C;&#xB85C; &#xC11C;&#xBC84;&#xB97C; &#xD655;&#xC7A5;&#xD55C;&#xB2E4;&#xBA74; &#xBD80;&#xB2F4;&#xC774; &#xB354; &#xCEE4;&#xC9C0;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p><p>&#xCC38;&#xACE0;:<a href="https://blogs.windows.com/windowsdeveloper/2016/03/14/when-to-use-a-http-call-instead-of-a-websocket-or-http-2-0/?ref=localhost">&#xC708;&#xB3C4;&#xC6B0; &#xD3F4;&#xB9C1;vs&#xC6F9; &#xC18C;&#xCF13;</a></p><p><strong>&#xCD5C;&#xC885;&#xC801;&#xC73C;&#xB85C;&#xB294; &#xC591;&#xBC29;&#xD5A5;&#xC131;&#xACFC; &#xC2E4;&#xC2DC;&#xAC04;&#xC131;, &#xD655;&#xC815;&#xC131;&#xC744; &#xACE0;&#xB824;&#xD574; Spring Websoket&#xACFC; STOMP&#xB97C; &#xD65C;&#xC6A9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</strong></p><ul><li>&#xC0AC;&#xC2E4; &#xB69C;&#xB837;&#xD558;&#xAC8C; &#xBAA9;&#xC801;&#xC774; &#xC5C6;&#xB2E4;&#xBA74; Http &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; Polling &#xBC29;&#xC2DD;&#xB3C4; &#xC88B;&#xC740; &#xBC29;&#xC2DD;&#xC774;&#xB77C;&#xB294; &#xC0DD;&#xAC01;&#xC774; &#xB4E4;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xA0;WebSocket&#xC758; &#xC591;&#xBC29;&#xD5A5; &#xC5F0;&#xACB0; &#xC790;&#xC6D0;&#xC5D0; &#xB300;&#xD55C; &#xC9C0;&#xC18D;&#xC801;&#xC778; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xAC00; &#xD544;&#xC694;&#xD558;&#xC9C0; &#xC54A;&#xB2E4;&#xBA74; &#xC989; &#xC9C0;&#xAE08; &#xC800;&#xC758; &#xCC44;&#xD305; &#xC11C;&#xBE44;&#xC2A4;&#xAC00; 1:N&#xC774;&#xB098; &#xC2E4;&#xC2DC;&#xAC04;&#xC774; &#xADF8;&#xB807;&#xAC8C; &#xC911;&#xC694;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xB2E8;&#xC21C; 1:1 &#xAE30;&#xB2A5;&#xB9CC; &#xC788;&#xB2E4;&#xBA74; &#xAD73;&#xC774; Web Socket&#xC740; &#xD544;&#xC694;&#xD558;&#xC9C0; &#xC54A;&#xACA0;&#xB2E4;&#xB294; &#xC0DD;&#xAC01;&#xC744; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul><p>&#xB0B4;&#xAC00; &#xC791;&#xC131;&#xD55C; &#xBA54;&#xC138;&#xC9C0;&#xB97C; &#xC0C1;&#xB300;&#xBC29;&#xC5D0;&#xAC8C; &#xC2E4;&#xC2DC;&#xAC04;&#xC73C;&#xB85C; &#xA0;&#xC804;&#xC1A1;&#xD574;&#xC57C; &#xD560; &#xB54C; &#xC5EC;&#xB7EC; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC811;&#xC18D;&#xD560; &#xACBD;&#xC6B0;&#xB97C; &#xB300;&#xBE44;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; STOMP &#xB610;&#xD55C; &#xC0AC;&#xC6A9; &#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. STOMP &#xC0AC;&#xC6A9;&#xD560; &#xACBD;&#xC6B0;</p><ul><li><strong>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xC11C;&#xBC84; &#xAC04;&#xC758; &#xD1B5;&#xC2E0;&#xC5D0;&#xC11C; &#xC77C;&#xAD00;&#xC131;&#xC744; &#xC720;&#xC9C0;</strong>(&#xBA54;&#xC2DC;&#xC9C0; &#xD615;&#xC2DD;&#xC744; &#xC9C0;&#xC815;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.)</li><li>STOMP&#xC758; PUB/SUB&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xA0;&#xBA54;&#xC138;&#xC9C0; &#xCC98;&#xB9AC;&#xC5D0; &#xC6A9;&#xC774;&#xD569;&#xB2C8;&#xB2E4;.</li><li>&#xBA54;&#xC2DC;&#xC9C0; &#xBE0C;&#xB85C;&#xCEE4; &#xAE30;&#xB2A5;&#xC744; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul><p>Spring&#xC5D0; &#xC788;&#xB294;**@EnableWebScoketMessageBroker** &#xC5B4;&#xB178;&#xD14C;&#xC774;&#xC158;&#xC744; &#xD65C;&#xC6A9;&#xD574; &#xAD6C;&#xD604;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xCC38;&#xACE0;: <a href="https://jinn-blog.tistory.com/152?ref=localhost">Stomp</a></p><pre><code class="language-java">@Configuration
@EnableWebSocketMessageBroker
public class WebSocketConfig implements WebSocketMessageBrokerConfigurer {

  @Override
  public void configureMessageBroker(MessageBrokerRegistry config) {
    config.enableSimpleBroker(&quot;/topic&quot;);
    config.setApplicationDestinationPrefixes(&quot;/app&quot;);
  }

  @Override
  public void registerStompEndpoints(StompEndpointRegistry registry) {
    registry.addEndpoint(&quot;/gs-guide-websocket&quot;);
  }

}
</code></pre><h2 id="%EB%AC%B8%EC%A0%9C-%EB%B0%9C%EC%83%9D">&#xBB38;&#xC81C; &#xBC1C;&#xC0DD;</h2><p>WebSocket STOMP&#xB97C; &#xD65C;&#xC6A9;&#xD574; &#xAD6C;&#xB3C5;/&#xBC1C;&#xD589;(&#xD1A0;&#xD53D; &#xAE30;&#xC900;)&#xC744; &#xD1B5;&#xD55C; &#xC6F9;&#xC18C;&#xCF13; &#xC5F0;&#xACB0; &#xA0;&#xCC44;&#xD305;&#xC744; <a href="https://chrome.google.com/webstore/detail/simple-websocket-client/pfdhoblngboilpfeibdedpjgfnlcodoo?ref=localhost">simple WebSocket Client</a>&#xC744; &#xD1B5;&#xD574; &#xC798; &#xC804;&#xB2EC; &#xB418;&#xB294; &#xAC83; &#xAE4C;&#xC9C0; &#xD655;&#xC778;&#xD588;&#xC9C0;&#xB9CC;.</p><p>&#xC9C0;&#xAE08; &#xD604;&#xC7AC; &#xD658;&#xACBD;&#xC5D0;&#xC11C;&#xC758; &#xBA54;&#xC2DC;&#xC9C0; &#xBE0C;&#xB85C;&#xCEE4;, &#xBA54;&#xC2DC;&#xC9C0; &#xD050;&#xB294; &#xC2A4;&#xD504;&#xB9C1; &#xBD80;&#xD2B8; &#xC11C;&#xBC84;&#xC758; &#xB0B4;&#xBD80; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB9CC;&#xC57D; &#xB2E4;&#xC218;&#xC758; &#xC11C;&#xBC84;&#xAC00; &#xC788;&#xC744; &#xACBD;&#xC6B0; &#xC6B4;&#xC601;&#xD558;&#xAE30; &#xC27D;&#xC9C0; &#xC54A;&#xB2E4;&#xB294; &#xBB38;&#xC81C;&#xC810;&#xC774; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xADF8;&#xB807;&#xB2E4;&#xBA74; &#xC774; &#xC2DC;&#xC810;&#xC5D0; &#xC77C;&#xC885;&#xC758; &#xC678;&#xBD80; &#xBA54;&#xC2DC;&#xC9C0; &#xBE0C;&#xB85C;&#xCEE4; &#xAE30;&#xB2A5;&#xC744; &#xD558;&#xB294; &#xC11C;&#xBC84;&#xB97C; &#xB744;&#xC6B8; &#xD544;&#xC694;&#xAC00; &#xC788;&#xB2E4;&#xB294; &#xC0DD;&#xAC01;&#xC774; &#xB4E4;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><strong>&#xC2A4;&#xD504;&#xB9C1; &#xBB38;&#xC11C;&#xC758; &#xADF8;&#xB9BC;(&#xC678;&#xBD80; &#xBE0C;&#xB85C;&#xCEE4; &#xC5F0;&#xB3D9;&#xC804;)</strong></p><figure class="kg-card kg-image-card"><img src="http://localhost:2368/content/images/2023/11/image.png" class="kg-image" alt loading="lazy" width="2000" height="781" srcset="http://localhost:2368/content/images/size/w600/2023/11/image.png 600w, http://localhost:2368/content/images/size/w1000/2023/11/image.png 1000w, http://localhost:2368/content/images/size/w1600/2023/11/image.png 1600w, http://localhost:2368/content/images/2023/11/image.png 2000w" sizes="(min-width: 720px) 720px"></figure><p><strong>(&#xC678;&#xBD80; &#xBE0C;&#xB85C;&#xCEE4; &#xC5F0;&#xB3D9; &#xD6C4;)</strong></p><figure class="kg-card kg-image-card"><img src="http://localhost:2368/content/images/2023/11/image-1.png" class="kg-image" alt loading="lazy" width="2000" height="798" srcset="http://localhost:2368/content/images/size/w600/2023/11/image-1.png 600w, http://localhost:2368/content/images/size/w1000/2023/11/image-1.png 1000w, http://localhost:2368/content/images/size/w1600/2023/11/image-1.png 1600w, http://localhost:2368/content/images/2023/11/image-1.png 2000w" sizes="(min-width: 720px) 720px"></figure><p>&#xC704;&#xC758; &#xADF8;&#xB9BC;&#xACFC; &#xAC19;&#xC774; &#xBA54;&#xC2DC;&#xC9C0; &#xBC1C;&#xD589; &#xC2DC; &#xC778; &#xBA54;&#xBAA8;&#xB9AC; &#xAE30;&#xBC18;&#xC77C; &#xACBD;&#xC6B0; &#xC720;&#xC2E4; &#xB420; &#xAC00;&#xB2A5;&#xC131;&#xC774; &#xC788;&#xC9C0;&#xB9CC; &#xC678;&#xBD80; &#xBE0C;&#xB85C;&#xCEE4;&#xB97C; &#xD1B5;&#xD574; PUB/SUB &#xD558;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;. &#xA0;&#xB610;&#xD55C; &#xBA54;&#xC2DC;&#xC9C0; &#xBE0C;&#xB85C;&#xCEE4;&#xB97C; &#xD1B5;&#xD574; &#xAD6C;&#xB3C5;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xA0;&#xC218;&#xD3C9;&#xC801; &#xD655;&#xC7A5;&#xC744; &#xD1B5;&#xD574; &#xC778;&#xD504;&#xB77C;&#xB97C; &#xAD6C;&#xCD95;&#xD560; &#xB54C; &#xB354; &#xC6A9;&#xC774; &#xD569;&#xB2C8;&#xB2E4;.</p><p><em><strong>RabbitMQ, Redis, kafka</strong> &#xB4F1;&#xC774; &#xB9CE;&#xC774; &#xC4F0;&#xC774;&#xC9C0;&#xB9CC; Rdis&#xB97C; &#xB3C4;&#xC785; &#xD558;&#xAE30;&#xB85C; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</em> &#xCE90;&#xC2DC;&#xC758; &#xC5ED;&#xD560;&#xB3C4; &#xAC00;&#xB2A5;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774;&#xB97C; &#xC0DD;&#xAC01;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. (&#xC774;&#xD6C4;&#xC5D0; &#xC9C4;&#xD589;&#xD558;&#xBA70; &#xC5EC;&#xAE30; &#xC11C;&#xB3C4; &#xBB38;&#xC81C;&#xB97C; &#xACAA;&#xAC8C; &#xB418;&#xB294;&#xB370;&#xC694;. redis&#xB294; &#xC778; &#xBA54;&#xBAA8;&#xB9AC; &#xAE30;&#xBC18;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC11C;&#xBC84;&#xAC00; &#xB2E4;&#xC6B4; &#xB420;&#xC2DC; Redis&#xB0B4;&#xC758; &#xBAA8;&#xB4E0; &#xB370;&#xC774;&#xD130;&#xAC00; &#xB0A0;&#xB77C; &#xAC00;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xC0DD;&#xAE30;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;.)</p><p>&#xB610;&#xD55C; <strong>Redis-Cluster</strong>&#xB97C; &#xD65C;&#xC6A9;&#xD574; &#xBD84;&#xC0B0; &#xC800;&#xC7A5;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xC989; &#xB2E8;&#xC21C; Spring Stomp&#xB97C; &#xC774;&#xC6A9;&#xD55C; &#xC778; &#xBA54;&#xBAA8;&#xB9AC; &#xC800;&#xC7A5; &#xBC29;&#xC2DD;&#xC5D0;&#xC11C; &#xBC97;&#xC5B4;&#xB098; &#xC678;&#xBD80; Message Broker&#xB97C; &#xD65C;&#xC6A9;&#xD558;&#xC5EC; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740; &#xC774;&#xC810;&#xC744; &#xCC59;&#xACBC;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ul><li>&#xC218;&#xD3C9;&#xC801; &#xD655;&#xC7A5; &#xC2DC; &#xC774;&#xC810;</li><li>&#xC11C;&#xBC84;&#xAC00; &#xB2E4;&#xC218;&#xC77C; &#xACBD;&#xC6B0; &#xD55C; &#xACF3;&#xC5D0;&#xC11C; PUB/SUB &#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xAD00;&#xB9AC;&#xD558;&#xAE30; &#xC6A9;&#xC774;&#xD558;&#xB2E4;.</li><li>&#xC778; &#xBA54;&#xBAA8;&#xB9AC; &#xBC29;&#xC2DD;&#xC774; &#xC544;&#xB2D0; &#xACBD;&#xC6B0; PUB/SUB &#xD560; &#xB54C; &#xB0B4;&#xC6A9;&#xC744; &#xC800;&#xC7A5; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;.</li></ul><p>&#xB2E4;&#xC74C; <strong>WebSocketController</strong>&#xB97C; &#xAD6C;&#xD604; &#xD55C; &#xD6C4; &#xC18C;&#xCF13;&#xC744; &#xD1B5;&#xD574; &#xBA54;&#xC2DC;&#xC9C0;&#xAC00; &#xB4E4;&#xC5B4;&#xC624;&#xBA74; &#xBC1B;&#xC544;&#xC11C; &#xD574;&#xB2F9;&#xB418;&#xB294; &#xCC44;&#xB110;&#xB85C; &#xC804;&#xB2EC;&#xD558;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;. &#xCC44;&#xD305; &#xBC29; &#xC815;&#xBCF4;&#xB098; &#xCC44;&#xD305; &#xBC29; &#xB85C;&#xADF8;&#xB294; Mysql&#xC5D0; &#xC800;&#xC7A5;&#xD558;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;.</p><h3 id="%EC%B0%B8%EA%B3%A0">&#xCC38;&#xACE0;</h3><p><strong><code>&#xBA54;&#xC2DC;&#xC9C0;/&#xC774;&#xBCA4;&#xD2B8; &#xBE0C;&#xB85C;&#xCEE4;</code></strong> &#xB450; &#xAC00;&#xC9C0;&#xB85C; &#xAD6C;&#xBD84;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><strong>Kafka(&#xC774;&#xBCA4;&#xD2B8; &#xBE0C;&#xB85C;&#xCEE4; ,&#xBA54;&#xC2DC;&#xC9C0; &#xBE0C;&#xB85C;&#xCEE4;), RabbitMQ,Redis(&#xBA54;&#xC138;&#xC9C0; &#xBE0C;&#xB85C;&#xCEE4;)</strong>&#x2022; &#xBA54;&#xC2DC;&#xC9C0; &#xBE0C;&#xB85C;&#xCEE4;&#xB294; &#xC774;&#xBCA4;&#xD2B8; &#xBE0C;&#xB85C;&#xCEE4;&#xAC00; &#xB420; &#xC218; &#xC5C6;&#xC73C;&#xB098;, &#xC774;&#xBCA4;&#xD2B8; &#xBE0C;&#xB85C;&#xCEE4;&#xB294; &#xBA54;&#xC2DC;&#xC9C0; &#xBE0C;&#xB85C;&#xCEE4;&#xAC00; &#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;(&#xBA54;&#xC2DC;&#xC9C0;&#xB294; &#xC0AD;&#xC81C;&#xB418;&#xACE0;, &#xC774;&#xBCA4;&#xD2B8;&#xB294; &#xC0AD;&#xC81C;&#xB418;&#xC9C0; &#xC54A;&#xAE30; &#xB54C;&#xBB38;)</p><h1 id="%EB%91%90-%EB%B2%88%EC%A7%B8-%EC%8B%9C%EB%8F%84">&#xB450; &#xBC88;&#xC9F8; &#xC2DC;&#xB3C4;</h1><p>&#xC704;&#xC758; &#xC0C1;&#xD669;&#xC744; &#xC815;&#xB9AC;&#xD574; &#xBCF4;&#xC790;&#xBA74; Web Socket, Stomp &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC600;&#xACE0; Spring&#xC5D0;&#xC11C; &#xC9C0;&#xC6D0;&#xD574;&#xC8FC;&#xB294; &#xB0B4;&#xBD80; &#xBA54;&#xC2DC;&#xC9C0; &#xBE0C;&#xB85C;&#xCEE4; &#xAE30;&#xB2A5;&#xC744; &#xC678;&#xBD80; &#xBA54;&#xC2DC;&#xC9C0; &#xBE0C;&#xB85C;&#xCEE4;(Redis)&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xB2E8;&#xACC4;&#xAE4C;&#xC9C0; &#xC9C4;&#xD589;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xC774;&#xB97C; &#xD1A0;&#xB300;&#xB85C; &#xCC44;&#xD305; &#xB3C4;&#xBA54;&#xC778;&#xC744; &#xAC1C;&#xBC1C;&#xD558;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAD6C;&#xC870;&#xB97C; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xC694;&#xC57D;&#xD558;&#xC790;&#xBA74; &#xBC11;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="language-java">&#x23BF; product// &#xC911;&#xACE0; &#xC0C1;&#xD488;.
&#x23BF; member // &#xD68C;&#xC6D0;.
&#x23BF; town// &#xB3D9;&#xB124; &#xC9C0;&#xC5ED;.
&#x23BF; oauth // &#xD68C;&#xC6D0; &#xC778;&#xC99D;&#xC778;&#xAC00;.
&#x23BF; interested// &#xAD00;&#xC2EC; &#xC0C1;&#xD488;.
///&#xCC44;&#xD305; &#xB3C4;&#xBA54;&#xC778;
&#x23BF; chatlog// &#xCC44;&#xD305; &#xB85C;&#xADF8;.
&#x23BF; chatroom// &#xCC44;&#xD305; &#xBC29;.
</code></pre><p>chatlog&#xC640; chatroom &#xB3C4;&#xBA54;&#xC778; &#xCABD;&#xC758; &#xAE30;&#xB2A5;&#xC744; &#xD06C;&#xAC8C;</p><ul><li>&#xCC44;&#xD305; &#xC77D;&#xAE30;,&#xBCF4;&#xB0B4;&#xAE30;, &#xBC29; &#xB9CC;&#xB4E4;&#xAE30; &#xAE30;&#xB2A5;&#xACFC; &#xCD94;&#xAC00;&#xC801;&#xC73C;&#xB85C; &#xC54C;&#xB9BC; ,&#xC548; &#xC77D;&#xC740; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xAE30;&#xD68D; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul><h2 id="%EB%AC%B8%EC%A0%9C-%EB%B0%9C%EC%83%9D-1">&#xBB38;&#xC81C; &#xBC1C;&#xC0DD;</h2><p>&#xD558;&#xC9C0;&#xB9CC; &#xC5EC;&#xAE30;&#xC11C; &#xCD94;&#xAC00;&#xC801;&#xC778; &#xBB38;&#xC81C;&#xAC00; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;. <strong>ChatService</strong>&#xBD80;&#xBD84;&#xC5D0;&#xC11C; &#xC5EC;&#xB7EC; &#xC758;&#xC874;&#xC131;&#xC774; &#xACB9;&#xCE58;&#xB294; &#xAD6C;&#xAC04;&#xC774; &#xC0DD;&#xACBC;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="language-java">public class ChatService {

    private final ChannelTopic channelTopic;
    private final ChatRoomRedisRepository chatRoomRedisRepository;
    private final MemberRepository memberRepository;
    private final ProductService productService;
    private final ChatRoomService chatRoomService;
    private final RedisTemplate redisTemplate;
		.... &#xC0DD;&#xB7B5;
}
</code></pre><p>&#xB610;&#xD55C; &#xCC44;&#xD305; &#xC11C;&#xBE44;&#xC2A4; &#xB85C;&#xC9C1;&#xC774; &#xD55C; &#xD2B8;&#xB80C;&#xC81D;&#xC158;&#xC774; &#xBAA8;&#xB450; &#xBB36;&#xC774;&#xB2E4; &#xBCF4;&#xB2C8; &#xC5EC;&#xB7EC; &#xBB38;&#xC81C;&#xAC00; &#xBC1C;&#xC0DD;&#xD588;&#xB294;&#xB370;&#xC694;.</p><p>&#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xC758;&#xC0AC; &#xCF54;&#xB4DC;&#xB85C; &#xC815;&#xB9AC; &#xD574;&#xBCF4;&#xC790;&#xBA74;</p><ul><li>&#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xCC44;&#xD305; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xBC1C;&#xC1A1;&#xD55C;&#xB2E4;.</li><li>&#xCC44;&#xD305; &#xC54C;&#xB78C;&#xC744; &#xC0C1;&#xB300;&#xBC29;&#xC774; &#xBC1B;&#xC744; &#xC218; &#xC788;&#xB2E4;.</li><li>&#xCC44;&#xD305; &#xBA54;&#xC2DC;&#xC9C0;&#xAC00; &#xC800;&#xC7A5;&#xB418;&#xC5B4;&#xC57C; &#xD55C;&#xB2E4;.</li><li>&#xCC44;&#xD305;&#xBC29; MetaInfo&#xB97C; &#x2018;&#xC548; &#xC77D;&#xC740; &#xBA54;&#xC2DC;&#xC9C0;&#x2019; &#xAC1C;&#xC218;&#xC640; &#x2018;&#xCC44;&#xD305;&#xBC29;&#xC5D0; &#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; &#xBC1C;&#xC1A1;&#xB41C; &#xBA54;&#xC2DC;&#xC9C0;&#x2019;&#xAC00; &#xAC31;&#xC2E0;&#xB418;&#xC5B4;&#xC57C; &#xD55C;&#xB2E4;.</li></ul><h1 id="%EC%9B%90%EC%9D%B8"><strong><strong>&#xC6D0;&#xC778;</strong></strong></h1><h1 id="%ED%95%B4%EA%B2%B0-%EB%B0%A9%EB%B2%95">&#xD574;&#xACB0; <strong>&#xBC29;&#xBC95;</strong></h1><p><strong>&apos;&#xC11C;&#xBE44;&#xC2A4; &#xAC04;&#xC758; &#xAC15;&#xD55C; &#xC758;&#xC874;&#xC131;&#xC744; &#xC904;&#xC774;&#xC790;&apos;</strong></p><h1 id="%EA%B2%B0%EA%B3%BC"><strong><strong>&#xACB0;&#xACFC;</strong></strong></h1>]]></content:encoded></item><item><title><![CDATA[Oauth로그인 리팩토링]]></title><description><![CDATA[<p>&#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC9C4;&#xD589; &#xD558;&#xBA70; &#xD68C;&#xC6D0; &#xAC00;&#xC785; &#xC11C;&#xBE44;&#xC2A4;&#xC758; &#xC77C;&#xBD80;&#xBD84;&#xC778; Oauth &#xB85C;&#xADF8;&#xC778; &#xBD80;&#xBD84;&#xC744; &#xCD1D; 3 &#xB2E8;&#xACC4;&#xC5D0; &#xAC78;&#xCCD0; &#xB9AC;&#xD329; &#xD1A0;&#xB9C1;&#xC744; &#xC9C4;&#xD589;&#xD558;&#xC600;&#xACE0; &#xADF8; &#xACFC;&#xC815;&#xC5D0;&#xC11C;</p>]]></description><link>http://localhost:2368/posts/</link><guid isPermaLink="false">650fddfcf73c6c4074cc43f8</guid><category><![CDATA[Posts]]></category><dc:creator><![CDATA[gamja]]></dc:creator><pubDate>Sun, 24 Sep 2023 06:59:20 GMT</pubDate><content:encoded><![CDATA[<p>&#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC9C4;&#xD589; &#xD558;&#xBA70; &#xD68C;&#xC6D0; &#xAC00;&#xC785; &#xC11C;&#xBE44;&#xC2A4;&#xC758; &#xC77C;&#xBD80;&#xBD84;&#xC778; Oauth &#xB85C;&#xADF8;&#xC778; &#xBD80;&#xBD84;&#xC744; &#xCD1D; 3 &#xB2E8;&#xACC4;&#xC5D0; &#xAC78;&#xCCD0; &#xB9AC;&#xD329; &#xD1A0;&#xB9C1;&#xC744; &#xC9C4;&#xD589;&#xD558;&#xC600;&#xACE0; &#xADF8; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xACAA;&#xC740; &#xACE0;&#xBBFC;&#xC774;&#xB098; &#xD574;&#xACB0; &#xACFC;&#xC815;&#xC744; &#xC815;&#xB9AC;&#xD574;&#xBCF4;&#xACE0;&#xC790; &#xD569;&#xB2C8;&#xB2E4;.</p><h2 id="%EB%AC%B8%EC%A0%9C-%EC%A0%95%EC%9D%98">&#xBB38;&#xC81C; &#xC815;&#xC758;</h2><p>&#xB85C;&#xADF8;&#xC778; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xC9C4;&#xD589;&#xD558;&#xBA70; &#xD68C;&#xC6D0; &#xAC00;&#xC785;&#xC744; Oauth&#xB97C; &#xD1B5;&#xD574; &#xD558;&#xAE30;&#xB85C; &#xACB0;&#xC815;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCD5C;&#xCD08; Github&#xB97C; &#xD1B5;&#xD574; &#xD558;&#xAE30;&#xB85C; &#xACB0;&#xC815;&#xD588;&#xACE0;, &#xA0;Github&#xB97C; &#xD1B5;&#xD574; &#xD68C;&#xC6D0; &#xC815;&#xBCF4;&#xB97C; &#xBC1B;&#xC544; Jwt&#xB97C; &#xD1B5;&#xD574; &#xB85C;&#xADF8;&#xC778; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xAD6C;&#xCD95;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h3 id="%EB%AC%B8%EC%A0%9C-%EB%B0%9C%EC%83%9D">&#xBB38;&#xC81C; &#xBC1C;&#xC0DD;</h3><p>&#xD300;&#xC6D0;&#xB4E4; &#xACFC;&#xC758; &#xC758;&#xB17C; &#xD6C4; &#xCD94;&#xAC00;&#xC801;&#xC778; &#xD68C;&#xC6D0; &#xAC00;&#xC785; &#xD50C;&#xB7AB;&#xD3FC; &#xD655;&#xC7A5;&#xC744; &#xC704;&#xD574; Kakao Oauth &#xB610;&#xD55C; &#xB3C4;&#xC785; &#xD558;&#xAE30;&#xB85C; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C; &#xBB38;&#xC81C;&#xAC00; &#xBC1C;&#xC0DD;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xA0;&#xD655;&#xC7A5;&#xC131;&#xC744; &#xACE0;&#xB824;&#xD558;&#xC9C0; &#xC54A;&#xC740; &#xC124;&#xACC4;&#xC5D0; &#xC758;&#xD574; &#xB2E4;&#xB978; &#xD50C;&#xB7AB;&#xD3FC; &#xD68C;&#xC6D0; &#xAC00;&#xC785;&#xC2DC; API&#xB97C; &#xD558;&#xB098; &#xB354; &#xCD94;&#xAC00; &#xD574;&#xC57C;&#xD588;&#xACE0; &#xA0;&#xAE30;&#xC874;&#xC758; &#xCF54;&#xB4DC;&#xC5D0; &#xC911;&#xBCF5;&#xC774; &#xB9CE;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h2 id="%EC%9B%90%EC%9D%B8">&#xC6D0;&#xC778;</h2><p></p><!--kg-card-begin: markdown--><pre><code class="language-java">    @Transactional
    public MemberLoginResponse login(String code) {
        AccessTokenResponseDTO token = oauth.getToken(code);
        logger.debug(&quot;token access &#xD1A0;&#xD070; = {}&quot;, token);
        OAuthMemberInfoDTO memberInfo = oauth.getUserInfo(token.getAccessToken());

        if (MemberExists(memberInfo)) {
            Member member = findMemberByMemberName(memberInfo.getLogin());
            Member updateMember = memberRepository.save(member.update(memberInfo, token.getAccessToken()));
            String jwtToken = jwtService.createToken(updateMember);
            return MemberLoginResponse.of(updateMember, jwtToken);
        }

        Member member = memberRepository.save(Member.create(memberInfo, token.getAccessToken()));
        String jwtToken = jwtService.createToken(member);
        
        return MemberLoginResponse.of(member, jwtToken);
    }
</code></pre>
<!--kg-card-end: markdown--><!--kg-card-begin: markdown--><pre><code class="language-java">  @Operation(
            summary = &quot;&#xAE43;&#xD5C8;&#xBE0C; &#xB85C;&#xADF8;&#xC778;&quot;,
            tags = &quot;member&quot;,
            description = &quot;&#xC0AC;&#xC6A9;&#xC790; &#xAE43;&#xD5C8;&#xBE0C;&#xB97C; &#xD1B5;&#xD55C; &#xB85C;&#xADF8;&#xC778;&quot;
    )
    @PostMapping(&quot;/auth/login&quot;)
    public BasicResponse&lt;MemberLoginResponse&gt; login(@RequestParam String code) throws IOException, InterruptedException {
        MemberLoginResponse memberResponseDTO = memberService.login(code);

        return BasicResponse.&lt;MemberLoginResponse&gt;builder()
                .success(true)
                .message(&quot;&quot;)
                .apiStatus(20000)
                .httpStatus(HttpStatus.OK)
                .data(memberResponseDTO)
                .build();
    }

</code></pre>
<!--kg-card-end: markdown--><p>&#xCEE8;&#xD2B8;&#xB864;&#xB7EC;&#xC640; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xC704;&#xC640; &#xAC19;&#xC774; &#xAD6C;&#xD604;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. Service &#xB808;&#xC774;&#xC5B4;&#xC5D0;&#xC11C; code&#xB97C; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xB85C; &#xBC1B;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774; &#xCF54;&#xB4DC;&#xB294; Oauth&#xB97C; &#xD574;&#xC8FC;&#xB294; &#xD50C;&#xB7AB;&#xD3FC;&#xC73C;&#xB85C; &#xBD80;&#xD130; &#xBC1B;&#xB294; &#xCF54;&#xB4DC;&#xC774;&#xACE0; &#xC774;&#xCF54;&#xB4DC;&#xB85C;&#xB294; &#xC0AC;&#xC2E4; &#xC5B4;&#xB5A4; &#xD50C;&#xB7AB;&#xD3FC;&#xC73C;&#xB85C; &#xBD80;&#xD130; &#xBC1B;&#xC740; &#xCF54;&#xB4DC;&#xC778;&#xC9C0;&#xB294; Spring&#xC5D0;&#xC11C; &#xD655;&#xC778; &#xD560; &#xC218; &#xAC00; &#xC5C6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC989; Kakao &#xD68C;&#xC6D0; &#xAC00;&#xC785; &#xC804;&#xC6A9; Api&#xB97C; &#xB9CC;&#xB4E0;&#xB2E4; &#xD558;&#xB354;&#xB77C;&#xB3C4; Service&#xC5D0;&#xC11C;&#xB294; Kakao&#xC5D0;&#xC11C; &#xC628; &#xAC83;&#xC778;&#xC9C0; Github&#xC5D0;&#xC11C; &#xC628; &#xAC83;&#xC778;&#xC9C0; &#xC54C; &#xC218; &#xAC00; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h2 id="%EC%B2%AB-%EB%B2%88%EC%A7%B8-%ED%95%B4%EA%B2%B0%EC%B1%85">&#xCCAB; &#xBC88;&#xC9F8; &#xD574;&#xACB0;&#xCC45;</h2><p>&#xCC98;&#xC74C; &#xB4E0; &#xC0DD;&#xAC01;&#xC740; &#xB2E8;&#xC21C;&#xD788; API&#xB97C; &#xD558;&#xB098; &#xB354; &#xB9CC;&#xB4E4;&#xC790; &#xC600;&#xC2B5;&#xB2C8;&#xB2E4;. Kakao &#xC804;&#xC6A9; Api&#xB97C; &#xB9CC;&#xB4E4;&#xACE0; &#xC774;&#xB97C; &#xAD6C;&#xBD84; &#xD560; &#xC218; &#xC788;&#xB294; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4; &#xD0C0;&#xC785;&#xC744; &#xB9CC;&#xB4E4;&#xC5B4; Service &#xB808;&#xC774;&#xC5D0;&#xC11C; &#xD0C0;&#xC785;&#xC744; &#xAD6C;&#xBD84;&#xD558;&#xC790; &#xB77C;&#xB294; &#xC0DD;&#xAC01;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h3 id="%EC%BB%A8%ED%8A%B8%EB%A1%A4%EB%9F%AC%EC%97%90-api%EB%A5%BC-%ED%95%98%EB%82%98-%EB%8D%94-%EC%B6%94%EA%B0%80">&#xCEE8;&#xD2B8;&#xB864;&#xB7EC;&#xC5D0; Api&#xB97C; &#xD558;&#xB098; &#xB354; &#xCD94;&#xAC00;</h3><!--kg-card-begin: markdown--><pre><code class="language-java">  @Operation(
            summary = &quot;&#xCE74;&#xCE74;&#xC624; &#xB85C;&#xADF8;&#xC778;&quot;,
            tags = &quot;members&quot;,
            description = &quot;&#xC0AC;&#xC6A9;&#xC790; &#xCE74;&#xCE74;&#xC624;&#xB97C; &#xD1B5;&#xD55C; &#xB85C;&#xADF8;&#xC778;&quot;
    )
    @PostMapping(&quot;/auth/kakao/login&quot;)
    public BasicResponse&lt;MemberLoginResponse&gt; kakaoLogin(@RequestBody KakaoRequestCode params) {
        log.debug(&quot;&#xD504;&#xB860;&#xD2B8;&#xB85C; &#xBD80;&#xD130; &#xBC1B;&#xC740; &#xCF54;&#xB4DC; = {}&quot;, params);
        MemberLoginResponse memberResponseDTO = memberService.login(params);

        return BasicResponse.send(&quot;&#xCE74;&#xCE74;&#xC624; &#xB85C;&#xADF8;&#xC778;&quot;, memberResponseDTO);
    }
</code></pre>
<!--kg-card-end: markdown--><p>&#xC704;&#xC640; &#xAC19;&#xC740; Api&#xB97C; &#xD558;&#xB098; &#xB354; &#xB9CC;&#xB4E4;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC2E4;&#xC0C1; github&#xC640; &#xD638;&#xCD9C;&#xD558;&#xB294; uri&#xC640; request dto&#xB9CC; &#xB2E4;&#xB97C; &#xBFD0; &#xAC19;&#xC740; login &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; return&#xD569;&#xB2C8;&#xB2E4;.</p><h3 id="%EA%B0%81-%ED%94%8C%EB%9E%AB%ED%8F%BC%EC%9D%80-%EC%9D%B8%ED%84%B0%ED%8E%98%EC%9D%B4%EC%8A%A4%EB%A5%BC-%EA%B5%AC%ED%98%84%ED%95%98%EB%8F%84%EB%A1%9D-%ED%95%9C%EB%8B%A4">&#xAC01; &#xD50C;&#xB7AB;&#xD3FC;&#xC740; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xB97C; &#xAD6C;&#xD604;&#xD558;&#xB3C4;&#xB85D; &#xD55C;&#xB2E4;. </h3><!--kg-card-begin: markdown--><pre><code class="language-java">@Getter
@NoArgsConstructor
public class KakaoRequestCode implements OAuthLoginParams {
    private String authorizationCode;

    @Override
    public OAuthProvider oAuthProvider() {
        return OAuthProvider.KAKAO;
    }


    @Override
    public MultiValueMap&lt;String, String&gt; makeBody() {
        MultiValueMap&lt;String, String&gt; body = new LinkedMultiValueMap&lt;&gt;();
        body.add(&quot;code&quot;, authorizationCode);
        return body;
    }
}
</code></pre>
<pre><code class="language-java">public interface OAuthLoginParams {
    OAuthProvider oAuthProvider();

    MultiValueMap&lt;String, String&gt; makeBody();
}
</code></pre>
<pre><code class="language-java">//&#xC774; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xB97C; &#xCE74;&#xCE74;&#xC624;&#xC640; &#xAE43;&#xD5C8;&#xBE0C;&#xAC00; &#xAC01;&#xAC01; &#xAD6C;&#xD604;&#xD558;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;.
  public interface Oauth {
    
    OAuthProvider oAuthProvider();

    AccessTokenResponseDTO getToken(OAuthLoginParams params);

    OAuthInfoResponse getUserInfo(String accessToken);
}
 
</code></pre>
<!--kg-card-end: markdown--><p>&#xC704;&#xC640; &#xAC19;&#xC774; <strong>OAuthLoginParams &#xA0;</strong>&#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xB97C; &#xD1B5;&#xD574; &#xA0;&#xAC01; &#xD50C;&#xB7AB;&#xD3FC;&#xC744; &#xBE44;&#xAD50;&#xD558;&#xACE0; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0;&#xC11C; &#xAC01; &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0; &#xB9DE;&#xAC8C; &#xB054; requestOAuthInfoService.request(params, userAgent); &#xC5D0; &#xB9DE;&#xB294; OAuthInfoResponse(&#xCE74;&#xCE74;&#xC624;&#xB098;, &#xAE43;&#xD5C8;&#xBE0C;&#xB85C; &#xBD80;&#xD130; &#xBC1B;&#xC740; &#xC720;&#xC800; &#xC815;&#xBCF4;)&#xB97C; &#xBC1B;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;.</p><p></p><!--kg-card-begin: markdown--><pre><code class="language-java">@Component
public class RequestOAuthInfoService {
    private final Map&lt;OAuthProvider, Oauth&gt; clients;

    public RequestOAuthInfoService(List&lt;Oauth&gt; clients) {
        this.clients = clients.stream().collect(
                Collectors.toUnmodifiableMap(Oauth::oAuthProvider, Function.identity())
        );
    }

    public OAuthInfoResponse request(OAuthLoginParams params) {
        Oauth client = clients.get(params.oAuthProvider());
        AccessTokenResponseDTO token = client.getToken(params);
        return client.getUserInfo(String.valueOf(token));
    }
}
</code></pre>
<!--kg-card-end: markdown--><p>&#xC704; &#xC11C;&#xBE44;&#xC2A4; &#xD074;&#xB808;&#xC2A4;&#xC5D0;&#xC11C; parms&#xB97C; &#xBE44;&#xAD50;&#xD558;&#xC5EC; &#xAC01; oauth&#xC5D0; &#xB9DE;&#xB294; Dto&#xB97C; &#xBC18;&#xD658;&#xD558;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;.</p><!--kg-card-begin: markdown--><pre><code class="language-java">  @Transactional
    public MemberLoginResponse login(OAuthLoginParams params, String userAgent) throws IOException {
        OAuthInfoResponse oAuthInfoResponse = requestOAuthInfoService.request(params, userAgent);

      ````&#xC0DD;&#xB7B5;
        return MemberLoginResponse.of(member, jwtToken);
    }
</code></pre>
<!--kg-card-end: markdown--><p>&#xC774;&#xB85C;&#xC11C; Reuqest&#xC5D0; &#xB530;&#xB77C; &#xAC01; &#xD50C;&#xB81B;&#xD3FC;&#xC744; &#xAD6C;&#xBD84; &#xD558;&#xC5EC; &#xADF8;&#xC5D0; &#xB9DE;&#xB294; dto&#xB97C; &#xBC18;&#xD658; &#xD560; &#xC218; &#xC788;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h3 id="%EB%91%90-%EB%B2%88%EC%A7%B8-%EB%AC%B8%EC%A0%9C">&#xB450; &#xBC88;&#xC9F8; &#xBB38;&#xC81C;</h3><p>&#xD558;&#xC9C0;&#xB9CC; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xD574;&#xB3C4; &#xBB38;&#xC81C;&#xAC00; &#xC644;&#xC804;&#xD788; &#xD574;&#xACB0;&#xB418;&#xC9C0;&#xB294; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC2E4; &#xD50C;&#xB81B;&#xD3FC;&#xC774; &#xCD94;&#xAC00;&#xB41C;&#xB2E4;&#xACE0; Api&#xAC00; &#xB298;&#xC5B4;&#xB098;&#xB294; &#xAC74; &#xC790;&#xC5F0;&#xC2A4;&#xB7FD;&#xC9C0; &#xBABB;&#xD55C; &#xD750;&#xB984;&#xC774;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xC694;&#xAD6C; &#xC0AC;&#xD56D;&#xC774; &#xBCC0;&#xACBD; &#xB420; &#xC2DC; &#xB9CC;&#xC57D; Naver&#xB098; Google&#xAC19;&#xC740; &#xB2E4;&#xB978; &#xC11C;&#xBE44;&#xC2A4;&#xAC00; &#xCD94;&#xAC00; &#xB41C;&#xB2E4;&#xACE0; &#xAC00;&#xC815;&#xD588;&#xC744; &#xB54C; &#xC9C0;&#xAE08;&#xC758; &#xAD6C;&#xC870;&#xC5D0;&#xC11C;&#xB294; &#xD50C;&#xB7AB;&#xD3FC;&#xC774; &#xCD94;&#xAC00; &#xB420; &#xB54C;&#xB9C8;&#xB2E4; Api&#xB97C; &#xCD94;&#xAC00; &#xD574;&#xC57C;&#xD558;&#xB294;&#xB370; &#xC774;&#xB294; &#xD14C;&#xC2A4;&#xD2B8; &#xAD00;&#xC810;&#xC5D0;&#xC11C; &#xBD24;&#xC744; &#xB54C;&#xB3C4; &#xBE44;&#xD6A8;&#xC728;&#xC801;&#xC774;&#xACE0; &#xAD73;&#xC774; &#xBC18;&#xBCF5;&#xB418;&#xB294; &#xC9C0;&#xB8E8;&#xD55C; &#xCF54;&#xB4DC;&#xB97C; &#xC368;&#xC57C; &#xD558;&#xB294; &#xBE44;&#xD6A8;&#xC728;&#xC131;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xA0; </p><p>&#xD0C0;&#xC785;&#xC774; &#xB2E4;&#xB974;&#xB2E4; &#xD558;&#xB354;&#xB77C;&#xB3C4; &#xA0;login&#xC11C;&#xBE44;&#xC2A4; &#xCF54;&#xB4DC;&#xB294; &#xC791;&#xC740; &#xBD80;&#xBD84; &#xBE7C;&#xACE0;&#xB294; &#xB2E4; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBA54;&#xC11C;&#xB4DC;&#xB294; &#xD558;&#xB098;&#xB85C; &#xC720;&#xC9C0; &#xD558;&#xACE0; , &#xB610;&#xD55C; &#xBD88;&#xD544;&#xC694;&#xD55C; &#xD074;&#xB798;&#xC2A4;&#xB098; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xB97C; &#xC8FD;&#xC5EC; &#xC5ED;&#xD560;&#xACFC; &#xD611;&#xB825;&#xC5D0; &#xB9DE;&#xAC8C; &#xA0;&#xB9AC;&#xD329;&#xD1A0;&#xB9C1;&#xC774; &#xD544;&#xC694;&#xD55C; &#xC2DC;&#xC810;&#xC774;&#xB77C; &#xD310;&#xB2E8;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xC815;&#xB9AC;&#xD574;&#xBCF4;&#xC790;&#xBA74;</p><ol><li>&#xCEE8;&#xD2B8;&#xB864;&#xB7EC;&#xC758; &#xBA54;&#xC11C;&#xB4DC;&#xB294; &#xD50C;&#xB81B;&#xD3FC;&#xC774; &#xB298;&#xC5B4;&#xB098;&#xB3C4; &#xD558;&#xB098;&#xB85C; &#xC720;&#xC9C0;&#xD558;&#xC790;.</li><li>&#xCF54;&#xB4DC;&#xC758; &#xAC00;&#xB3C5;&#xC131;&#xC774; &#xB5A8;&#xC5B4;&#xC9C0;&#xACE0; &#xD074;&#xB798;&#xC2A4;&#xB4E4;&#xC758; &#xC5ED;&#xD560;&#xC774; &#xBAA8;&#xD638;&#xD55C; &#xBD80;&#xBD84;&#xC774; &#xB9CE;&#xB2E4;. &#xB9AC;&#xD329;&#xD1A0;&#xB9C1;&#xC774; &#xD544;&#xC694;&#xD558;&#xB2E4;.</li></ol><h2 id="%EB%91%90-%EB%B2%88%EC%A7%B8-%ED%95%B4%EA%B2%B0%EC%B1%85">&#xB450; &#xBC88;&#xC9F8; &#xD574;&#xACB0;&#xCC45;</h2><!--kg-card-begin: markdown--><pre><code class="language-java">    @PostMapping(&quot;/{provider}/login&quot;)
    public BasicResponse&lt;LoginResponse&gt; login(@PathVariable OAuthProvider provider,
                                              @RequestBody @Valid LoginRequest request,
                                              @NotNullParam(message = &quot;code &#xAC12;&#xC740; &#xBC18;&#xB4DC;&#xC2DC; &#xB4E4;&#xC5B4;&#xC640;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.&quot;) String code) {
        LoginResponse login = authService.login(provider, request, code);
        return BasicResponse.send(HttpStatus.OK.value(), &quot;&#xCE74;&#xCE74;&#xC624; &#xB85C;&#xADF8;&#xC778;&quot;, login);
    }
</code></pre>
<!--kg-card-end: markdown--><p><strong>&quot;/{provider}/login&quot; &#xA0;</strong>provider&#xB97C; @PathVariable&#xB85C; &#xBC1B;&#xB294; &#xD615;&#xC2DD;&#xC73C;&#xB85C; &#xBCC0;&#xACBD;&#xD569;&#xB2C8;&#xB2E4;.</p><p><strong>OAuthProvider&#xB294; </strong>Enum&#xC744; &#xD1B5;&#xD574; &#xBC11;&#xC5D0;&#xC640; &#xAC19;&#xC774; &#xAD6C;&#xD604;&#xD574; &#xC90D;&#xB2C8;&#xB2E4;. </p><pre><code class="language-java">
@Getter
@RequiredArgsConstructor
public enum OAuthProvider {

    KAKAO(&quot;kakao&quot;),
    GITHUB(&quot;github&quot;);

    private final String name;
    private OAuthRequester oAuthRequester;

    public static OAuthProvider of(final String name) {
        return Arrays.stream(OAuthProvider.values())
                .filter(provider -&gt; provider.name.equals(name))
                .findFirst()
                .orElseThrow(() -&gt; new NotFoundException(ErrorMessage.OAUTH_PROVIDER_NOT_FOUND));
    }

    private void injectOAuthClient(OAuthRequester oAuthRequester) {
        this.oAuthRequester = oAuthRequester;
    }

    @RequiredArgsConstructor
    @Component
    static class OAuthClientInjector {

        private final GithubRequester githubRequester;
        private final KakaoRequester kakaoRequester;

        @PostConstruct
        public void injectOAuthClient() {
            Arrays.stream(OAuthProvider.values()).forEach(oAuthProvider -&gt; {
                if (oAuthProvider == GITHUB) {
                    oAuthProvider.injectOAuthClient(githubRequester);
                }
                if (oAuthProvider == KAKAO) {
                    oAuthProvider.injectOAuthClient(kakaoRequester);
                }
            });
        }
    }
}
</code></pre><p>Injection &#xD574;&#xC8FC;&#xB294; &#xB0B4;&#xBD80; &#xD074;&#xB798;&#xC2A4;&#xB97C; &#xAD6C;&#xD604;&#xD55C; &#xD6C4; @PostConstruct&#xB97C;&#xD1B5;&#xD574;(Spring&#xC5D0;&#xC11C; &#xB77C;&#xC774;&#xD504; &#xC0AC;&#xC774;&#xD074;&#xC744; &#xACE0;&#xB824;&#xD55C; &#xAD8C;&#xC7A5;&#xD558;&#xB294; &#xBC29;&#xBC95;)&#xC744; &#xD1B5;&#xD574; &#xA0;<strong>oAuthRequster</strong> &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xC5D0; &#xCEE8;&#xD2B8;&#xB864;&#xB7EC;&#xC5D0;&#xC11C; &#xB4E4;&#xC5B4;&#xC628; oAuthProvider&#xC758; enum&#xAC12;&#xC5D0; &#xB9DE;&#xB294; &#xAC12;&#xC744; inject&#xD574;&#xC90D;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xB41C;&#xB2E4;&#xBA74; &#xCD5C;&#xC885; &#xC801;&#xC73C;&#xB85C; &#xA0;oAuthProvider&#xC758; &#xD544;&#xB4DC;&#xC778; oAuthRequester&#xC5D0; &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0; &#xB9DE;&#xB294; &#xC54C;&#xB9DE;&#xC740; &#xAC12;&#xC774; &#xB4E4;&#xC5B4;&#xC624;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xADF8; &#xD6C4;</p><pre><code class="language-java"> @Transactional
    public LoginResponse login(OAuthProvider oAuthProvider, LoginRequest request, String code) {
        OAuthRequester oAuthRequester = oAuthProvider.getOAuthRequester();
        OauthTokenResponse tokenResponse = oAuthRequester.getToken(code);
		```&#xC0DD;&#xB7B5;
    }</code></pre><p>oAuthProvider.getOAuthRequester() &#xB97C; &#xD1B5;&#xD574; oAuthRequester&#xB97C; &#xAC00;&#xC838;&#xC628; &#xD6C4; &#xD1A0;&#xD070;&#xC744; &#xC5BB;&#xC5B4; &#xC624;&#xBA74;&#xB429;&#xB2C8;&#xB2E4;. &#xC774; &#xB54C; getToken&#xC740; &#xA0;&#xACB0;&#xAD6D; get&#xC744; &#xD1B5;&#xD574; &#xAC00;&#xC838;&#xC628; &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0; &#xADF8;&#xC804;&#xACFC; &#xAC19;&#xC774; &#xD68C;&#xC6D0; &#xC815;&#xBCF4;&#xB97C; &#xC694;&#xCCAD; &#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p><h2 id="%EA%B2%B0%EA%B3%BC"><br>&#xACB0;&#xACFC;</h2><p>&#xC774;&#xB97C; &#xD1B5;&#xD574; &#xCD5C;&#xC885;&#xC801;&#xC73C;&#xB85C; &#xB124;&#xC774;&#xBC84;&#xB098; &#xAD6C;&#xAE00; &#xACFC; &#xAC19;&#xC774; &#xB2E4;&#xB978; &#xD50C;&#xB7AB;&#xD3FC;&#xC744; &#xCD94;&#xAC00; &#xD558;&#xACE0; &#xC2F6;&#xC744; &#xACBD;&#xC6B0; &#xC11C;&#xBE44;&#xC2A4;, &#xCEE8;&#xD2B8;&#xB864;&#xB7EC; &#xB808;&#xC774;&#xC5B4; &#xCF54;&#xB4DC;&#xB294; &#xAC74;&#xB4E4;&#xC9C0; &#xC54A;&#xACE0; Enum&#xC5D0; &#xCD94;&#xAC00; &#xD574;&#xC900; &#xD6C4; <em>OAuthRequester&#xC758; &#xAD6C;&#xD604;&#xCCB4;&#xB9CC; &#xCD94;&#xAC00;&#xD574; &#xC8FC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. </em></p><p>&#xC774;&#xBC88; &#xB9AC;&#xD329;&#xD1A0;&#xB9C1;&#xC744; &#xD1B5;&#xD574; &#xD655;&#xC2E4;&#xD788; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xC640;, Enum&#xC744; &#xD65C;&#xC6A9;&#xD574; &#xCF54;&#xB4DC;&#xC758; &#xC911;&#xBCF5;&#xC744; &#xC904;&#xC774;&#xACE0; Controller, Service &#xCF54;&#xB4DC;&#xB294; &#xBCC0;&#xACBD;&#xC774; &#xC5C6;&#xB2E4;&#xB294; &#xC810;&#xC774; &#xC88B;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xAE43;&#xD5C8;&#xBE0C; &#xCD9C;&#xCC98;: <a href="https://github.com/masters2023-2nd-project-02/second-hand?ref=localhost">https://github.com/masters2023-2nd-project-02/second-hand</a><br></p>]]></content:encoded></item></channel></rss>